<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

In [2]:
# Load the Chinook database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///chinook.db

'Connected: @chinook.db'

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://github.com/Explore-AI/Pictures/blob/master/sqlite-sample-database-color.jpg?raw=true"  style="width:500px";/>
<br>
<br>
    <em>Figure 1: Chinook ERD</em>
</div>

[Image source](https://www.sqlitetutorial.net/sqlite-sample-database/)

### 1. Reading data from a single column in a single table in the database.

In [3]:
%%sql 

SELECT FirstName 
FROM customers
LIMIT 10; -- Remove this line to see the full result.

 * sqlite:///chinook.db
Done.

[('Luís',),
 ('Leonie',),
 ('François',),
 ('Bjørn',),
 ('František',),
 ('Helena',),
 ('Astrid',),
 ('Daan',),
 ('Kara',),
 ('Eduardo',)]

### 2. Reading data from multiple columns in a single table in the database.

In [4]:
%%sql

SELECT FirstName, LastName, HireDate
FROM employees;

 * sqlite:///chinook.db
Done.

[('Andrew', 'Adams', '2002-08-14 00:00:00'),
 ('Nancy', 'Edwards', '2002-05-01 00:00:00'),
 ('Jane', 'Peacock', '2002-04-01 00:00:00'),
 ('Margaret', 'Park', '2003-05-03 00:00:00'),
 ('Steve', 'Johnson', '2003-10-17 00:00:00'),
 ('Michael', 'Mitchell', '2003-10-17 00:00:00'),
 ('Robert', 'King', '2004-01-02 00:00:00'),
 ('Laura', 'Callahan', '2004-03-04 00:00:00')]

### 3. Reading data from multiple columns in multiple tables in the database.

In [5]:
%%sql

SELECT albums.Title, artists.Name
FROM albums, artists
LIMIT 10; -- Remove this line to see the full result

 * sqlite:///chinook.db
Done.

[('For Those About To Rock We Salute You', 'AC/DC'),
 ('For Those About To Rock We Salute You', 'Accept'),
 ('For Those About To Rock We Salute You', 'Aerosmith'),
 ('For Those About To Rock We Salute You', 'Alanis Morissette'),
 ('For Those About To Rock We Salute You', 'Alice In Chains'),
 ('For Those About To Rock We Salute You', 'Antônio Carlos Jobim'),
 ('For Those About To Rock We Salute You', 'Apocalyptica'),
 ('For Those About To Rock We Salute You', 'Audioslave'),
 ('For Those About To Rock We Salute You', 'BackBeat'),
 ('For Those About To Rock We Salute You', 'Billy Cobham')]

In [6]:
%%sql

SELECT albums.Title, artists.Name
FROM albums, artists
WHERE artists.Artistid = albums.Artistid
LIMIT 10; -- Remove this line to see the full result

 * sqlite:///chinook.db
Done.

[('For Those About To Rock We Salute You', 'AC/DC'),
 ('Balls to the Wall', 'Accept'),
 ('Restless and Wild', 'Accept'),
 ('Let There Be Rock', 'AC/DC'),
 ('Big Ones', 'Aerosmith'),
 ('Jagged Little Pill', 'Alanis Morissette'),
 ('Facelift', 'Alice In Chains'),
 ('Warner 25 Anos', 'Antônio Carlos Jobim'),
 ('Plays Metallica By Four Cellos', 'Apocalyptica'),
 ('Audioslave', 'Audioslave')]